tutorials/WTG_singleWake/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform  0.615812;    // (HW:Eq. 6)

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
        value           uniform 0;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    top
    {
        type            fixedValue;
        value	uniform 0.615812;
    }

    sides
    {
        type            symmetry;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;
    }
    /*
    concentrator
    {
        type            zeroGradient;
    }*/
}


// ************************************************************************* //
