tutorials/WTG_singleWake/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    RASModel            kEpsilonFp;

    turbulence          on;

    printCoeffs         on;

    kEpsilonFpCoeffs
    {
        Cmu         4.5;
        Cmu         0.03;
        C1          1.21;
        C2          1.92;
        sigmaEps    1.3; 
        
    }
}

// ************************************************************************* //
