tutorials/WTG_singleWake/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale               1;

// x = streamwise
// y = spanwise
// z = wall-normal



vertices
(
	(	-1260.00	-1008.00000	0	)	//0
	(	1890.00	-1008.00000	0	)	//1
	(	1890.00	1008.00000	0	)	//2
	(	-1260.00	1008.00000	0	)	//3
	(	-1260.00	-1008.00000	2016.00	)	//4
	(	1890.00	-1008.00000	2016.00	)	//5
	(	1890.00	1008.00000	2016.00	)	//6
	(	-1260.00	1008.00000	2016.00	)	//7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (175 50 91)  
    simpleGrading 
    (
    (
	(	0.12000	0.08571	0.26385	)
	(	0.56000	0.80000	1.00000	)
	(	0.32000	0.11429	10.00000	)

    )
    (
(	0.40625	0.26000	0.11236	)
(	0.18750	0.48000	1.00000	)
(	0.40625	0.26000	8.90000	)



    )
    
	(
	(0.1875 0.824176 89)
	(0.8125 0.175824 15.4)
	)
	
    
    )
);


edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sides
    {
        type symmetry;
        faces
        (
            (1 5 4 0)
            (2 3 7 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
