tutorials/WTG_singleWake/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             cellLimited Gauss linear 1.0;
    grad(U)             cellLimited Gauss linear 1.0;
    grad(p)             cellLimited Gauss linear 0.5;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss QUICK; // bounded Gauss linearUpwindV default;
    div(phi,epsilon)    Gauss linearUpwind default;
    div(phi,k)          Gauss linearUpwind default;

    div((nuEff*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear limited 1.0;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             limited 1.0;
}
wallDist
{
    method              meshWave;
}


// ************************************************************************* //
