tutorials/WTG_singleWake/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-12;
        relTol           0.05;
        smoother         GaussSeidel;
    }

    "(U|k|epsilon)"
    {
        solver           PBiCGStab;
        preconditioner         DILU;
        tolerance        1e-12;
        relTol           0.05;
        minIter          3;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent	true;

    residualControl
    {
        p               1e-7;
        U               1e-7;
        "(k|epsilon)"   1e-7;
    }
}

relaxationFactors
{
    fields
    {
        p               1.0;
    }
    equations
    {
        U               0.9;
        k               0.9;
        epsilon         0.9;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
